Revit 2027 API
DisplacementElement.IsAllowedAsDisplacedElement Method
 Indicates if the specified element is allowed to be displaced.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsAllowedAsDisplacedElement(
	Element element
)
Public Shared Function IsAllowedAsDisplacedElement (
	element As Element
) As Boolean
public:
static bool IsAllowedAsDisplacedElement(
	Element^ element
)
static member IsAllowedAsDisplacedElement :
        element : Element -> bool
Parameters
element Element
 Any element.
Return Value
Boolean
 Returns true if the element is eligible to be assigned to a DisplacementElement.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Exclusions include view specific elements as well as certain categories of elements.
See Also
Reference
DisplacementElement Class
Autodesk.Revit.DB Namespace